* Notes
  :PROPERTIES:
  :ID:       4391d46d-e2d6-4f77-8822-faa1c972b411
  :END:
* Mutt FAQ  https://www.fefe.de/muttfaq/faq.html             :Technical:NOTE:
 [2021-06-26 Sat 03:51]
* Linux Kernel WIKI  https://wiki.kernel.org/                :Technical:NOTE:
 [2021-06-26 Sat]
* Vim Tips  https://vim.fandom.com/wiki/Best_Vim_Tips        :Technical:NOTE:
 [2021-06-26 Sat 16:54]
 :NOTE: [[https://vim.fandom.com/wiki/Best_Vim_Tips][Best vim tips site]]
* :NOTE: This are details of passport for the family                  :ATTACH:
  :PROPERTIES:
  :ID:       75395de8-7503-4034-8c5b-283d650bc50b
  :END:
  :LOGBOOK:
  CLOCK: [2021-06-05 Sat 11:18]--[2021-06-05 Sat 11:21] =>  0:03
  :END:
[2021-06-05 Sat 11:18]
[[file:~/.emacs.d/OrgFiles/task.org::*Reminds about passport renewals][Reminds about passport renewals]]
* The hand phone has to be replaced, it is almost defunct ..heck       :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-23 Wed 04:45]--[2021-06-23 Wed 04:46] =>  0:01
  :END:
[2021-06-23 Wed 04:45]
[[id:6b1261c4-1d37-44a4-9e4c-a511ff2d36af][file:~/.emacs.d/OrgFiles/task.org]]
* The laptop is showing it's age, highly needed a upgrade...meh        :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-23 Wed 04:47]--[2021-06-23 Wed 04:48] =>  0:01
  :END:
[2021-06-23 Wed 04:47]
[[id:6b1261c4-1d37-44a4-9e4c-a511ff2d36af][file:~/.emacs.d/OrgFiles/task.org]]
* AquaGuard gets old ...needs replacement...cost around 25k..wondering.. :NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 09:00]--[2021-06-24 Thu 09:01] =>  0:01
  :END:
[2021-06-24 Thu 09:00]
[[file:~/.emacs.d/OrgFiles/task.org::+TITLE: Keep track of things which needs attention]]
* GCC: [[https://gcc.gnu.org/][The GNU Compiler Collection]]                           :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:16]--[2021-06-24 Thu 14:17] =>  0:01
  :END:
[2021-06-24 Thu 14:16]
[[deft:contacts.org][contacts]]
* Clang: [[https://clang.llvm.org/][A C language family frontend for LLVM]]               :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:18]--[2021-06-24 Thu 14:19] =>  0:01
  :END:
[2021-06-24 Thu 14:18]
[[deft:notes.org][notes]]
* LLVM: [[https://www.llvm.org/][The LLVM Compiler Infrastructure]]                     :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:19]--[2021-06-24 Thu 14:20] =>  0:01
  :END:
[2021-06-24 Thu 14:19]
[[deft:notes.org][notes]]
* LFS: [[https://www.linuxfromscratch.org/][Linux From Scratch!]]                                   :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:21]--[2021-06-24 Thu 14:22] =>  0:01
  :END:
[2021-06-24 Thu 14:21]
[[deft:notes.org][notes]]
* Lex and Yacc : [[https://developer.ibm.com/technologies/systems/tutorials/au-lexyacc/][Lex and Yacc on IBM Developer site]]          :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:23]--[2021-06-24 Thu 14:23] =>  0:00
  :END:
[2021-06-24 Thu 14:23]
[[deft:notes.org][notes]]
* Lex and Yacc : [[http://dinosaur.compilertools.net/][Lex and Yacc page,all the info]]              :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:24]--[2021-06-24 Thu 14:24] =>  0:00
  :END:
[2021-06-24 Thu 14:24]
[[deft:notes.org][notes]]
* Bash Wiki: [[http://mywiki.wooledge.org/BashFAQ/006][Bash FAQ]]                                        :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:39]--[2021-06-24 Thu 14:40] =>  0:01
  :END:
[2021-06-24 Thu 14:39]
* Bash-Awesome: [[https://github.com/awesome-lists/awesome-bash][A curated bash goodies  ]]                     :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-06-24 Thu 14:41]--[2021-06-24 Thu 14:41] =>  0:00
  :END:
[2021-06-24 Thu 14:41]
* Emacs key binds to find information C-h-k for keybinds,C-h-v for varibables,C-h-f for function :NOTE:
  :LOGBOOK:
  CLOCK: [2021-07-03 Sat 17:27]--[2021-07-03 Sat 17:29] =>  0:02
  :END:
[2021-07-03 Sat 17:27]
* Monthly internet and phone bill pay,approx 1.5k                      :NOTE:
  :LOGBOOK:
  CLOCK: [2021-07-04 Sun 04:48]--[2021-07-04 Sun 04:49] =>  0:01
  :END:
[2021-07-04 Sun 04:48]
* Exide Inverter Battery Info                                    :@home:NOTE:
    Battery : A3F0K107237
    Machine : GQP850
    Service Center: 9836966071
     Shop number: 9830529646

  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:18]--[2021-07-20 Tue 04:20] =>  0:02
  :END:
[2021-07-20 Tue 04:18]
* My Profile                                              :@work:NOTE:ATTACH:
  :PROPERTIES:
  :ID:       7743bef9-38b9-47dc-bb7f-fb8af19c54e8
  :END:
  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:21]--[2021-07-20 Tue 04:23] =>  0:02
  :END:
[2021-07-20 Tue 04:21]
* Electricity Consumer info                                            :NOTE:
  115075732
  sunsolaris16
  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:24]--[2021-07-20 Tue 04:24] =>  0:00
  :END:
[2021-07-20 Tue 04:24]
* MA Sankar Netralaya MRD No                                           :NOTE:
  520967
  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:25]--[2021-07-20 Tue 04:25] =>  0:00
  :END:
[2021-07-20 Tue 04:25]
* GPG backup and restore keys                                   :NOTE:ATTACH:
  :PROPERTIES:
  :ID:       5dc4304b-f412-476a-ab07-c463bb3cfaca
  :END:

  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:26]--[2021-07-20 Tue 04:27] =>  0:01
  :END:
[2021-07-20 Tue 04:26]
* Questions to Recuiters                                        :NOTE:ATTACH:
  :PROPERTIES:
  :ID:       82a6e98a-bc92-4590-853b-77f93dc6a2f3
  :END:

  :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:28]--[2021-07-20 Tue 04:28] =>  0:00
  :END:
[2021-07-20 Tue 04:28]
* SSH Cheatsheet                                                :NOTE:ATTACH:
  :PROPERTIES:
  :ID:       ebd5f654-430f-4e5c-828a-478c1a451e5d
  :END:
    :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:41]--[2021-07-20 Tue 04:41] =>  0:00
  :END:
[2021-07-20 Tue 04:41]
* WPA Cli procedure get connected to internet                   :NOTE:ATTACH:
  :PROPERTIES:
  :ID:       5b554888-b040-4a5e-b68f-8efa1dc7c486
  :END:
    :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:42]--[2021-07-20 Tue 04:42] =>  0:00
  :END:
[2021-07-20 Tue 04:42]
* Firefox userChrome and userContent css files                  :NOTE:ATTACH:
  :PROPERTIES:
  :ID:       b3ff2e72-38c4-4137-80a9-98f170b632cf
  :END:
    :LOGBOOK:
  CLOCK: [2021-07-20 Tue 04:43]--[2021-07-20 Tue 04:44] =>  0:01
  :END:
[2021-07-20 Tue 04:43]
* Bash Oneliner                                                        :NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-09 Mon 12:09]--[2021-08-09 Mon 12:10] =>  0:01
  :END:
[2021-08-09 Mon 12:09]
[[https://onceupon.github.io/Bash-Oneliner/][https://onceupon.github.io/Bash-Oneliner/]]
* Git bisection to find bug in the kernel                              :NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-19 Thu 14:17]--[2021-08-19 Thu 14:18] =>  0:01
  :END:
[2021-08-19 Thu 14:17]
[[https://mirrors.edge.kernel.org/pub/software/scm/git/docs/git-bisect-lk2009.html][https://mirrors.edge.kernel.org/pub/software/scm/git/docs/git-bisect-lk2009.html]]
* Sysadmin Resources                                                   :NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-23 Mon 14:17]--[2021-08-23 Mon 14:18] =>  0:01
  :END:
[2021-08-23 Mon 14:17]
[[https://github.com/kahun/awesome-sysadmin][https://github.com/kahun/awesome-sysadmin]]
* Aws-scripting                                              :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 11:10]--[2021-08-31 Tue 11:11] =>  0:01
  :END:
[2021-08-31 Tue 11:10]
[[http://bruxy.regnet.cz/web/programming/EN/awscli/][http://bruxy.regnet.cz/web/programming/EN/awscli/]]
* SSH Tricks: Reverse Tunnel and via Bastion Host            :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 11:30]--[2021-08-31 Tue 11:31] =>  0:01
  :END:
[2021-08-31 Tue 11:30]
[[http://bruxy.regnet.cz/web/linux/EN/ssh-bastion/][http://bruxy.regnet.cz/web/linux/EN/ssh-bastion/]]
* Online disk resizing in Cloud and on perm                  :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 11:40]--[2021-08-31 Tue 11:40] =>  0:00
  :END:
[2021-08-31 Tue 11:40]
[[http://bruxy.regnet.cz/web/linux/EN/disk-resize/][http://bruxy.regnet.cz/web/linux/EN/disk-resize/]]
* SSH-Agent Abuse ...illegal access                          :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 12:25]--[2021-08-31 Tue 12:25] =>  0:00
  :END:
[2021-08-31 Tue 12:25]
[[http://bruxy.regnet.cz/web/linux/EN/ssh-agent/][http://bruxy.regnet.cz/web/linux/EN/ssh-agent/]]
* AWS DNS related stuff                                      :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 12:56]--[2021-08-31 Tue 12:57] =>  0:01
  :END:
[2021-08-31 Tue 12:56]
[[http://bruxy.regnet.cz/web/linux/EN/route53-domain-transfer-problem/][http://bruxy.regnet.cz/web/linux/EN/route53-domain-transfer-problem/]]
* VIM Cheatsheet                                             :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 13:31]--[2021-08-31 Tue 13:31] =>  0:00
  :END:
[2021-08-31 Tue 13:31]
[[http://bruxy.regnet.cz/web/programming/EN/vim-cheat-sheet/][http://bruxy.regnet.cz/web/programming/EN/vim-cheat-sheet/]]
* Python CheatSheet                                          :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 13:32]--[2021-08-31 Tue 13:32] =>  0:00
  :END:
[2021-08-31 Tue 13:32]
[[http://bruxy.regnet.cz/web/programming/EN/python-cheatsheet/][http://bruxy.regnet.cz/web/programming/EN/python-cheatsheet/]]
* Nginx redirection based on username                        :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-08-31 Tue 13:38]--[2021-08-31 Tue 13:39] =>  0:01
  :END:
[2021-08-31 Tue 13:38]
[[http://bruxy.regnet.cz/web/linux/EN/nginx-auth-redir/][http://bruxy.regnet.cz/web/linux/EN/nginx-auth-redir/]]
* CPU Isolation Part-I                                       :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-05 Sun 10:49]--[2021-09-05 Sun 10:49] =>  0:00
  :END:
[2021-09-05 Sun 10:49]
[[https://www.suse.com/c/cpu-isolation-introduction-part-1/][https://www.suse.com/c/cpu-isolation-introduction-part-1/]]
* CPU Isolation  Part-II                                     :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-05 Sun 10:49]--[2021-09-05 Sun 10:50] =>  0:01
  :END:
[2021-09-05 Sun 10:49]
[[https://www.suse.com/c/cpu-isolation-full-dynticks-part2/][https://www.suse.com/c/cpu-isolation-full-dynticks-part2/]]
* CPU Isolation PART-III                                     :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-05 Sun 10:50]--[2021-09-05 Sun 10:51] =>  0:01
  :END:
[2021-09-05 Sun 10:50]
[[https://www.suse.com/c/cpu-isolation-nohz_full-part-3/][https://www.suse.com/c/cpu-isolation-nohz_full-part-3/]]
* CPU Isolation Part-IV                                      :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-05 Sun 10:51]--[2021-09-05 Sun 10:52] =>  0:01
  :END:
[2021-09-05 Sun 10:51]
[[https://www.suse.com/c/cpu-isolation-housekeeping-and-tradeoffs-part-4/][https://www.suse.com/c/cpu-isolation-housekeeping-and-tradeoffs-part-4/]]
* Do Not Use -Werror in release code                         :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-06 Mon 17:15]--[2021-09-06 Mon 17:15] =>  0:00
  :END:
[2021-09-06 Mon 17:15]
[[https://flameeyes.blog/2009/02/25/future-proof-your-code-dont-use-werror/][https://flameeyes.blog/2009/02/25/future-proof-your-code-dont-use-werror/]]
* Search within Emacs with M-s M-w on Ewww                   :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-07 Tue 16:44]--[2021-09-07 Tue 16:45] =>  0:01
  :END:
[2021-09-07 Tue 16:44]
[[http://ergoemacs.org/emacs/blog.html][Xah Emacs Blog]]
* Linux Kernel Debugging tools and presentations             :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-08 Wed 15:40]--[2021-09-08 Wed 15:40] =>  0:00
  :END:
[2021-09-08 Wed 15:40]
[[https://elinux.org/Tools_and_Debugging_Presentations][https://elinux.org/Tools_and_Debugging_Presentations]]
* AWK explained                                              :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-10 Fri 03:18]--[2021-09-10 Fri 03:18] =>  0:00
  :END:
[2021-09-10 Fri 03:18]
[[https://medium.com/analytics-vidhya/use-awk-to-save-time-and-money-in-data-science-eb4ea0b7523f][https://medium.com/analytics-vidhya/use-awk-to-save-time-and-money-in-data-science-eb4ea0b7523f]]
* AWK pipeline for data processing                           :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-10 Fri 03:41]--[2021-09-10 Fri 03:42] =>  0:01
  :END:
[2021-09-10 Fri 03:41]
[[https://adamdrake.com/command-line-tools-can-be-235x-faster-than-your-hadoop-cluster.html][https://adamdrake.com/command-line-tools-can-be-235x-faster-than-your-hadoop-cluster.html]]
* AWK Wrappers                                               :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-10 Fri 04:30]--[2021-09-10 Fri 04:31] =>  0:01
  :END:
[2021-09-10 Fri 04:30]
[[https://github.com/cheusov/runawk][https://github.com/cheusov/runawk]]
* AWK Debugger                                               :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-10 Fri 04:32]--[2021-09-10 Fri 04:32] =>  0:00
  :END:
[2021-09-10 Fri 04:32]
[[https://www.gnu.org/software/gawk/manual/html_node/Debugger.html][https://www.gnu.org/software/gawk/manual/html_node/Debugger.html]]
* The UNIX Operating System                                  :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-09-14 Tue 02:58]--[2021-09-14 Tue 02:58] =>  0:00
  :END:
[2021-09-14 Tue 02:58]
[[https://dra.vin/unix-info/][https://dra.vin/unix-info/]]
* Linux Page Cache                                           :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-10-03 Sun 05:04]--[2021-10-03 Sun 05:05] =>  0:01
  :END:
[2021-10-03 Sun 05:04]
[[https://biriukov.dev/docs/page-cache/4-page-cache-eviction-and-page-reclaim/][https://biriukov.dev/docs/page-cache/4-page-cache-eviction-and-page-reclaim/]]
* MIT Assem                                                            :NOTE:
  :LOGBOOK:
  CLOCK: [2021-10-04 Mon 16:12]--[2021-10-04 Mon 16:13] =>  0:01
  :END:
[2021-10-04 Mon 16:12]
[[https://www.youtube.com/watch?v][https://www.youtube.com/watch?v]]
* Plan9 As desktop                                           :Technical:NOTE:
  :LOGBOOK:
  CLOCK: [2021-10-05 Tue 02:22]--[2021-10-05 Tue 02:22] =>  0:00
  :END:
[2021-10-05 Tue 02:21]
[[https://pspodcasting.net/dan/blog/2019/plan9_desktop.html][https://pspodcasting.net/dan/blog/2019/plan9_desktop.html]]
* Here are the most important keys to know when dealing with clocks :Technical: :NOTE:

Key	Calls	Action
C-c C-x C-i	org-clock-in	Clock in to the section you're currently in
C-c C-x C-x	org-clock-in-last	Clock in to the last clocked task
C-c C-x C-o	org-clock-out	Clock out of whatever you're clocked in to
C-c C-x C-j	org-clock-goto	Jump to whatever headline you are currently clocked in to
C-c C-x C-q	org-clock-cancel	Cancel the current clock (removes all of it's current time)
C-c C-x C-d	org-clock-display	Display clock times for headlines in current file
C-c C-x C-r	org-clock-report	Generate a report for clock activity
C-c C-x C-z	org-resolve-clocks	Resolve any half-open clocks
  :LOGBOOK:
  CLOCK: [2021-10-21 Thu 15:24]--[2021-10-21 Thu 15:25] =>  0:01
  :END:
[2021-10-21 Thu 15:24]
